## pandas loc

### loc/iloc

In [7]:
import pandas as pd
df = pd.read_csv('./data/train.csv')

mdf = df.iloc[0:5, 1:3]
print(mdf)

   Survived  Pclass
0         0       3
1         1       1
2         1       3
3         1       1
4         0       3

In [8]:
df = df.set_index('Name')
print(df.loc['Moran, Mr. James'])
print(df.loc['Moran, Mr. James', 'Fare'])

PassengerId         6
Survived            0
Pclass              3
Sex              male
Age               NaN
SibSp               0
Parch               0
Ticket         330877
Fare           8.4583
Cabin             NaN
Embarked            Q
Name: Moran, Mr. James, dtype: object
8.4583

### bool 索引

In [9]:
index = df['Fare'] < 50
print(index)
print(index.sum())
df[index].head(5)

Name
Braund, Mr. Owen Harris                                 True
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    False
Heikkinen, Miss. Laina                                  True
Futrelle, Mrs. Jacques Heath (Lily May Peel)           False
Allen, Mr. William Henry                                True
                                                       ...
Montvila, Rev. Juozas                                   True
Graham, Miss. Margaret Edith                            True
Johnston, Miss. Catherine Helen "Carrie"                True
Behr, Mr. Karl Howell                                   True
Dooley, Mr. Patrick                                     True
Name: Fare, Length: 891, dtype: bool
730

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S
"Moran, Mr. James",6,0,3,male,NaN,0,0,330877,8.4583,NaN,Q
"Palsson, Master. Gosta Leonard",8,0,3,male,2.0,3,1,349909,21.0750,NaN,S